In [6]:
import pandas as pd
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns 
#from pydataset import data
from scipy.stats import chi2
from scipy.stats import chi2_contingency
from CHAID import Tree
from scipy.cluster.hierarchy import dendrogram
import xlwt
from sklearn.preprocessing import LabelEncoder
from sklearn.feature_extraction import DictVectorizer
from sklearn import preprocessing
from sklearn.tree import DecisionTreeClassifier
from sklearn import tree

In [9]:
df = pd.read_csv('titanic.csv')

In [10]:
df.head()

   Unnamed: 0      class     age  sex survived
0           1  1st class  adults  man      yes
1           2  1st class  adults  man      yes
2           3  1st class  adults  man      yes
3           4  1st class  adults  man      yes
4           5  1st class  adults  man      yes

In [12]:
pd.crosstab(index=df['survived'],
            columns=[df['class'],df['age'],df['sex']],margins=True)

class    1st class                   2nd class                   3rd class  \
age         adults       child          adults       child          adults
sex            man women   man women       man women   man women       man
survived
no             118     4     0     0       154    13     0     0       387
yes             57   140     5     1        14    80    11    13        75
All            175   144     5     1       168    93    11    13       462

class                        All
age            child
sex      women   man women
survived
no          89    35    17   817
yes         76    13    14   499
All        165    48    31  1316

In [24]:
Tabla_clase = pd.crosstab(index=df['survived'],
            columns=[df['class']],margins=True)
Tabla_clase.index= ["yes","no","Total"]
Tabla_clase

class  1st class  2nd class  3rd class   All
yes          122        167        528   817
no           203        118        178   499
Total        325        285        706  1316

In [25]:
chi2_contingency(Tabla_clase)

(133.05203598610018,
 2.9249941496115534e-26,
 6,
 array([[ 201.76671733,  176.93389058,  438.2993921 ,  817.        ],
        [ 123.23328267,  108.06610942,  267.7006079 ,  499.        ],
        [ 325.        ,  285.        ,  706.        , 1316.        ]]))

In [26]:
print('Valor Chi-2', str(chi2_contingency(Tabla_clase)[0]), 'p-value', str(chi2_contingency(Tabla_clase)[1]))

Valor Chi-2 133.05203598610018 p-value 2.9249941496115534e-26

In [27]:
Tabla_edad = pd.crosstab(index=df['survived'],
            columns=[df['age']],margins=True)
Tabla_edad.index= ["yes","no","Total"]
Tabla_edad

age    adults  child   All
yes       765     52   817
no        442     57   499
Total    1207    109  1316

In [28]:
chi2_contingency(Tabla_edad)

(10.433234374362144,
 0.03372920198971611,
 4,
 array([[ 749.33054711,   67.66945289,  817.        ],
        [ 457.66945289,   41.33054711,  499.        ],
        [1207.        ,  109.        , 1316.        ]]))

In [29]:
print('Valor Chi-2', str(chi2_contingency(Tabla_edad)[0]), 'p-value', str(chi2_contingency(Tabla_edad)[1]))

Valor Chi-2 10.433234374362144 p-value 0.03372920198971611